#include <stdio.h>
#include <stdlib.h>
#include <time.h>

#define NUM 7

int main(void)
{
    //===============================================================
    // データの格納
    //===============================================================

    // srand()は乱数の初期値を変更する関数
    // time()はUNIX時間を返す関数
    // これにより実行の度に違う乱数を取得できる
    srand(time(NULL));
    int data[NUM];
    for (int i = 0; i < NUM; i++)
    {
        // rand()は0からRAND_MAX(電算室PCでは2147483647)の範囲の乱数を返す
        // 剰余を使って0から99の範囲に変換している
        int r = rand() % 100 + 1;
        data[i] = r;
    }

    //===============================================================
    // バブルソート
    //===============================================================
    int tmp;
    for(int i = 0; i< NUM; i++) {
        for(int j=0; j< NUM -1 - i; j++) {
            if(data[j] > data[j+1]) {
                tmp = data[j];
                data[j] = data[j+1];
                data[j+1] = tmp;
            }
        }
    }

    //===============================================================
    // データの表示
    //===============================================================
    for (int i = 0; i < NUM; i++)
    {
        printf("%d: %d\n", i, data[i]);
    }
    return 0;
}